lizhiok/FPInterro/Libraries/MDK_LIB/RL/CAN/Drivers/CAN_LPC229x.c
/*--------------------------- CAN_RX3_ISR -----------------------------------
 *
 *  CAN receive interrupt function, for CAN controller 3
 *  Reads message from hardware registers and puts it into receive mailbox
 *  for controller 3
 *
 *  Parameter:  none
 *
 *  Return:     none
 *---------------------------------------------------------------------------*/

static void CAN_RX3_ISR (void) __irq  {
  CAN_msg *ptrmsg;

  /* If mailbox isn't full read message from hardware and send it to message queue */
  if (os_mbx_check (MBX_rx_ctrl[2]) > 0) {
    ptrmsg = _alloc_box (CAN_mpool);
    CAN_hw_rd (3, ptrmsg);
    if (ptrmsg) isr_mbx_send (MBX_rx_ctrl[2], ptrmsg);
  }

  ptrCAN3->CANCMR = 0x04;             /* Release receive buffer              */
  VICVectAddr = 0xFFFFFFFF;           /* Acknowledge interrupt               */
}

#endif


#if USE_CAN_CTRL4 == 1

/*--------------------------- CAN_TX4_ISR ----------------------------------
 *
 *  CAN transmit interrupt function for controller 4
 *  If there are messages in mailbox for transmit it writes it to hardware
 *  and starts the transmission on controller 4
 *
 *  Parameter:  none
 *
 *  Return:     none
 *---------------------------------------------------------------------------*/

static void CAN_TX4_ISR (void) __irq  {
  CAN_msg *ptrmsg;
  U32 temp;

    /* If there is message in mailbox ready for send, 
       read the message from mailbox and send it                             */
    if (isr_mbx_receive (MBX_tx_ctrl[3], (void **)&ptrmsg) != OS_R_OK) {
      CAN_hw_wr (4, ptrmsg);
      _free_box(CAN_mpool, ptrmsg);
  } else {
    isr_sem_send(wr_sem[0]);      /* Return a token back to semaphore        */
  }

  /* Read from interrupt register to acknowledge interrupt                   */
  temp = ptrCAN4->CANICR;
  VICVectAddr = 0xFFFFFFFF;           /* Acknowledge Interrupt               */
}


/*--------------------------- CAN_RX4_ISR -----------------------------------
 *
 *  CAN receive interrupt function, for CAN controller 4
 *  Reads message from hardware registers and puts it into receive mailbox
 *  for controller 4
 *
 *  Parameter:  none
 *
 *  Return:     none
 *---------------------------------------------------------------------------*/

static void CAN_RX4_ISR (void) __irq  {
  CAN_msg *ptrmsg;

  /* If mailbox isn't full read message from hardware and send it to message queue */
  if (os_mbx_check (MBX_rx_ctrl[3]) > 0) {
    ptrmsg = _alloc_box (CAN_mpool);
    CAN_hw_rd (4, ptrmsg);
    if (ptrmsg) isr_mbx_send (MBX_rx_ctrl[3], ptrmsg);
  }

  ptrCAN4->CANCMR = 0x04;             /* Release receive buffer              */
  VICVectAddr = 0xFFFFFFFF;           /* Acknowledge interrupt               */
}

#endif


/*----------------------------------------------------------------------------
 * end of file
 *---------------------------------------------------------------------------*/

